<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"936c9f34927dd71000a7b00fa758ff9c0c6fd2e7546fee8b71b34dba5234d4f5","plan_job_ref":"Job Pull Request Checks #749 at https://github.com/GSA-TTS/FAC/actions/runs/6025955747","plan_hash":"ab60f0f4a5cb5b0e96a5616f3fc152cdd2f38b8ef640af6e6347e575c4c741f1","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dev.cloudfoundry_app.data_load will be created
  + resource "cloudfoundry_app" "data_load" {
      + buildpack                       = (known after apply)
      + disk_quota                      = 64
      + docker_image                    = "ghcr.io/gsa-tts/fac-historic-public-csvs/load-historic-public-data@sha256:bc012a8a2cde3044a6fc12b1b07c04a7abd6b3ab7c97ce1aeeb1ab7479027cd4"
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "port"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 1
      + memory                          = 64
      + name                            = "dataload"
      + ports                           = (known after apply)
      + space                           = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 180
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #749](https://github.com/GSA-TTS/FAC/actions/runs/6025955747)